ezois_ka/oooezoiskaobmen/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ПорчаТоваров</basedOn>
  <basedOn>Document.СборкаТоваров</basedOn>
  <basedOn>Document.ПрочееОприходованиеТоваров</basedOn>
  <basedOn>Document.ИзменениеАссортимента</basedOn>
  <basedOn>Document.ПриемкаТоваровНаХранение</basedOn>
  <basedOn>Document.ВводОстатков</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры25</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУстановокЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары2_5</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаЦО</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияЦО</name>
      <type>
        <types>CatalogRef.СерииНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаЦО</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКомпоновкиДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БазовыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаЦены</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательнаяЦена</name>
    <comment>Цена заполняется, но не записывается. Используется как вспомогательная для сложных расчетов других цен</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеЦеныЗаПределамиОтбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриВыпускеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриОптовойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеПродукцииДавальцу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПродаже</name>
    <comment>Устанавливается если выбраны при оптовой или розничной продажах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриРозничнойПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьОтборНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Округлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатывания</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатыванияПриУменьшении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияЦены</name>
    <type>
      <types>EnumRef.СпособыЗаданияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДействияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <comment>Общий / Индивидуальный</comment>
    <type>
      <types>EnumRef.НазначенияВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЦенуПриВводеНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанныхОтбораПоНоменклатуре</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекПараметровСпособаЗаданияЦены</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВлияющиеВидыЦен</name>
    <attributes>
      <name>ВлияющийВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОкругленияЦены</name>
    <attributes>
      <name>НижняяГраницаДиапазонаЦен</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочностьОкругления</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическоеОкругление</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСрабатывания</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатывания</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатыванияПриУменьшении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Валюты</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЦены</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/vs_УстановкаЦенПереопределяемый/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура vs_СозданиеОбновлениеДокументовУстановкаЦенНоменклатуры() Экспорт
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВидыЦен.Ссылка КАК Ссылка,
	//|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании КАК УстанавливатьЦенуПриВводеНаОсновании,
	//|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления
	//|ПОМЕСТИТЬ ВидыЦен
	//|ИЗ
	//|	Справочник.ВидыЦен КАК ВидыЦен
	//|ГДЕ
	//|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании
	//|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
	//|	И НЕ ВидыЦен.ПометкаУдаления
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	//|ПОМЕСТИТЬ ВТ_УстановкаЦенНоменклатуры
	//|ИЗ
	//|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	//|ГДЕ
	//|	УстановкаЦенНоменклатуры.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УстановкаЦенНоменклатуры.ДокументОснование
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	//|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
	//|	ВидыЦен.Ссылка КАК ВидЦены,
	//|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	//|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЦен КАК ВидыЦен
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	НЕ ПриобретениеТоваровУслугТовары.Ссылка В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	//|				ИЗ
	//|					ВТ_УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры)
	//|	И НЕ ПриобретениеТоваровУслугТовары.Цена = 0
	//|   И НЕ ПриобретениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПриобретениеТоваровУслугТовары.Номенклатура,
	//|	ПриобретениеТоваровУслугТовары.Ссылка,
	//|	ПриобретениеТоваровУслугТовары.Характеристика,
	//|	ВидыЦен.Ссылка,
	//|	ПриобретениеТоваровУслугТовары.Цена,
	//|	ПриобретениеТоваровУслугТовары.Упаковка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.Номенклатура КАК Номенклатура,
	//|	ВТ_Данные.Характеристика КАК Характеристика,
	//|	ВТ_Данные.Упаковка КАК Упаковка,
	//|	ВТ_Данные.ВидЦены КАК ВидЦены,
	//|	ВТ_Данные.Цена КАК Цена,
	//|	ВТ_Данные.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Данные.Ссылка";

	//ОбработатьЗапрос(Запрос);
	// begin fix 29.11.2022 16:26:19	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыЦен.Ссылка КАК Ссылка,
	|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании КАК УстанавливатьЦенуПриВводеНаОсновании,
	|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления,
	|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ ВидыЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании
	|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
	|	И НЕ ВидыЦен.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_УстановкаЦенНоменклатуры
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
	|	И УстановкаЦенНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаЦенНоменклатуры.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	//|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
	|	ВидыЦен.Ссылка КАК ВидЦены,
	//|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ВидыЦен.ЦенаВключаетНДС
	|				И ПТУ.ЦенаВключаетНДС
	|			ТОГДА ПриобретениеТоваровУслугТовары.Цена
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|				И НЕ ПТУ.ЦенаВключаетНДС
	|			ТОГДА ПриобретениеТоваровУслугТовары.Цена
	|		КОГДА ПриобретениеТоваровУслугТовары.Количество = 0
	|			ТОГДА 0
	|		КОГДА ВидыЦен.ЦенаВключаетНДС
	|				И НЕ ПТУ.ЦенаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ПриобретениеТоваровУслугТовары.СуммаСНДС / ПриобретениеТоваровУслугТовары.Количество КАК ЧИСЛО(15,2))
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|				И ПТУ.ЦенаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ПриобретениеТоваровУслугТовары.СуммаСНДС - ПриобретениеТоваровУслугТовары.СуммаНДС) / ПриобретениеТоваровУслугТовары.Количество КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК Цена,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПТУ
	|		ПО ПриобретениеТоваровУслугТовары.Ссылка = ПТУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ПриобретениеТоваровУслугТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|		ПО СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЦен КАК ВидыЦен
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ПриобретениеТоваровУслугТовары.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	|				ИЗ
	|					ВТ_УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры)
	|	И НЕ ПриобретениеТоваровУслугТовары.Цена = 0
	|   И НЕ СпрВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ПТУ.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ВидыЦен.Ссылка	//,
	//|	ПриобретениеТоваровУслугТовары.Цена,
	//|	ПриобретениеТоваровУслугТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	//|	ВТ_Данные.Упаковка КАК Упаковка,
	|	ВТ_Данные.ВидЦены КАК ВидЦены,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Ссылка";

	vs_ОбработатьЗапрос(Запрос);
	// end fix 29.11.2022 16:26:48
КонецПроцедуры

Процедура vs_ОбработатьЗапрос(Запрос)
	
	МассивПакетов = Запрос.ВыполнитьПакет();
	
	ДокументыКСозданию = МассивПакетов[МассивПакетов.ВГраница()].Выгрузить();
	
	ДанныеДокументов = МассивПакетов[МассивПакетов.ВГраница()-1].Выгрузить();
	
	Для Каждого Док из ДокументыКСозданию Цикл
		Ссылка = Док.Ссылка;
		Отбор = Новый  Структура("Ссылка",Ссылка);
		
		НайденныеСтроки = ДанныеДокументов.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() Тогда
			
			ТЗТемп = ДанныеДокументов.Скопировать(НайденныеСтроки);
			
			НовыйДок = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			НовыйДок.Товары.Загрузить(ТЗТемп);
			НовыйДок.Дата = Ссылка.Дата;
			НоваяСтрокаВидаЦен = НовыйДок.ВидыЦен.Добавить();
			НоваяСтрокаВидаЦен.ВидЦены =  НайденныеСтроки[0].ВидЦены;
			НовыйДок.ДокументОснование = Ссылка;
			НовыйДок.Согласован = Истина;
			НовыйДок.Статус =  Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВводОстатков") Тогда 
				НовыйДок.Дата = ?(ЗначениеЗаполнено(Ссылка.Партия),Ссылка.Партия.Дата,Ссылка.Дата);
				НовыйДок.Комментарий = Ссылка.Комментарий;
			КонецЕсли;
			    НовыйДок.Записать();
			Попытка
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				НС = ПолучитьНавигационнуюСсылку(НовыйДок.Ссылка);
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("ИмяСобытия","vs_СозданиеОбновлениеДокументовУстановкаЦенНоменклатуры");
				СтруктураСобытия.Вставить("ПредставлениеУровня","Ошибка");
				СтруктураСобытия.Вставить("Комментарий",НС+"; " +ОписаниеОшибки());
				СтруктураСобытия.Вставить("ДатаСобытия",ТекущаяДата());
				СобытияДляЖурналаРегистрации = Новый СписокЗначений;
				СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытия);
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
			КонецПопытки;
		КонецЕсли;
		
		
	КонецЦикла;

	
КонецПроцедуры

#КонецЕсли
